---
kind: method
id: M:Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.Dispose
source: html/51ea7332-9713-a8d1-986f-f9b3fc84a44e.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementRoundingManager.Dispose Method

Releases all resources used by the ReinforcementRoundingManager

## Syntax (C#)
```csharp
public void Dispose()
```